/* eslint-disable @typescript-eslint/no-explicit-any */

const content: unknown = {
  login: {
    loginTitle: "مرحبًا بك مرة أخرى في OAC!",
    loginDescription: "أدخل اسم المستخدم وكلمة المرور للمتابعة.",
    aboutTitle: "حول OAC",
    aboutDescription1:
      "يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم لـ OAC لعام 2024. تعالج هذه القواعد الاحتياجات المتطورة للتحكيم والمجتمعات التجارية وتسعى إلى تحسين كفاءة إجراءات التحكيم والوساطة.",
    aboutDescription2:
      "يُشجَّع الأطراف على مراجعة الأحكام في قواعد التحكيم الخاصة بـ OAC. يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم لـ OAC لعام 2024. تعالج هذه القواعد الاحتياجات المتطورة للتحكيم والمجتمعات التجارية وتسعى إلى تحسين كفاءة إجراءات التحكيم والوساطة.",
    forgotText: "نسيت كلمة المرور؟",
    loginButton: "تسجيل الدخول",
    registerText: "ليس لديك حساب؟",
    registerButton: "إنشاء حساب",
    errorText: "اسم المستخدم أو كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.",
  },
  fileACase: {
    link: "انقر هنا للاستمرار",
    title: "رفع قضية",
    select: "هنا الخدمات التي نقدمها. الرجاء اختيارها والمتابعة",
    description:
      "يتيح لك هذا النظام الإلكتروني تقديم قضية ضمن فئات مختلفة مثل التحكيم والوساطة، مما يضمن عملية قانونية مبسطة.",
    arbitration: {
      title: "التحكيم",
      description:
        "يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم الخاصة بـ OAC لعام 2024.",
    },
    mediation: {
      title: "الوساطة",
      description:
        "يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم الخاصة بـ OAC لعام 2024.",
    },
  },
  arbitrationType: {
    title: "اختر نوع التحكيم",
    description: "ابدأ. اختر وسيلة فض النزاع المفضلة لديك.",
    back: "رجوع",
    checkboxArb:
      "يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم الخاصة بـ OAC لعام 2024.",
    title2: "التحكيم السريع",
    descriptionFastrack: "يجب أن يتضمن طلب الإغاثة في التحكيم السريع:",
    descriptionFastrackList1:
      "المبلغ المتنازع عليه لا يتجاوز ما يعادل 500,000 ريال عماني، وهو مجموع الدعوى، الدعوى المضادة، وأي دفاع من خلال المقاصة.",
    descriptionFastrackList2:
      "اتفاق الأطراف على ذلك؛ أو في الحالات العاجلة كما يحددها اللجنة التنفيذية.",
    title3: "الإغاثة الطارئة",
    descriptionEmergency: "يجب أن يتضمن طلب الإغاثة المؤقتة الطارئة:",
    descriptionEmergencyList1: "طبيعة الإغاثة المطلوبة؛",
    descriptionEmergencyList2:
      "الأسباب التي تجعل الطرف مستحقًا لهذه الإغاثة؛ و",
    descriptionEmergencyList3:
      "بيان يشهد بأنه قد تم تزويد جميع الأطراف بنسخة من الطلب أو، إذا لم يكن ذلك، شرح للإجراءات المتخذة.",
    next: "التالي",
  },
  landingPage: {
    welcomeText: "مرحبًا بعودتك إلى مركز التحكيم التجاري العماني!",
    describtion: "هنا الخدمات التي نقدمها. الرجاء اختيارها والمتابعة",
    fileaCase: "رفع قضية",
    descriptionOne:
      "يتيح لك هذا النظام الإلكتروني تقديم قضية إلى OAC وفقًا لقواعد التحكيم الخاصة بـ OAC لعام 2024",
    membership: "العضوية",
    becomeAmember: "كن عضوًا",
  },
  stepper: {
    title: "طلب التحكيم",
    back: "رجوع",
    stepsDesc: "لرفع قضية تحكيم، أكمل الخطوات التالية:",
    stepsFor: "الخطوات لـ",
    step1: "تفاصيل الأطراف",
    step2: "تفاصيل المدعي",
    step3: "تفاصيل المدعى عليه",
    step4: "تفاصيل النزاع",
    step5: "نوع النزاع",
    step6: "تفاصيل التحكيم",
    step7: "اتفاق التحكيم",
    step8: "الهيئة التحكيمية",
    step9: "إعدادات التحكيم",
    step10: "التوحيد",
    step11: "بيان الدعوى",
    step12: "المستندات الداعمة",
  },
  navbar: {
    title1: "قضايانا",
    title2: "أحداث القضية",
    title3: "تقديم قضية",
    dropdownContent1: "ملفي الشخصي",
    dropdownContent2: "تسجيل الخروج",
  },
  footer: {
    titleHeader: "مركز عمان للتحكيم التجاري © 2024، جميع الحقوق محفوظة",
    titleItem1: "سياسة الخصوصية",
    titleItem2: "الشروط والأحكام",
  },
  signup: {
    header: "يرجى التسجيل للمتابعة",
    subHeader: "يرجى ملء التفاصيل التالية لمتابعة التسجيل",
    fullName: "الاسم الكامل",
    Address: "العنوان",
    Nationality: "الجنسية",
    Country: "الدولة",
    EmailID: "البريد الإلكتروني",
    PhoneNumber: "رقم الهاتف",
    EnterPassword: "أدخل كلمة المرور",
    ReEnterPassword: "أعد إدخال كلمة المرور",
    passCriteria1: "يجب أن تحتوي كلمة المرور على (8-20) حرفًا",
    passCriteria2: "على الأقل حرف واحد كبير وصغير",
    passCriteria3: "على الأقل رقم واحد (0-9)",
    passCriteria4: "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل",
    checkbox:
      "لقد قرأت وفهمت وأوافق على شروط الخدمة. أوافق على تلقي إشعارات عبر الرسائل القصيرة والبريد الإلكتروني من محاكم مركز دبي المالي العالمي.",
    signUp: "تسجيل",
    accountTitle: "هل لديك حساب بالفعل؟",
    loginBtn: "تسجيل الدخول",
  },
};

export default content;
